# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2fDeformable, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2fDeformable, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2fDeformable, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fDeformable, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head (with upsampling adjustments)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P4
  - [[-1, 6], 1, Concat, [1]]  # Concatenate P3 and P4 (after upsampling)
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P3
  - [[-1, 4], 1, Concat, [1]]  # Concatenate P3 and P4 (after upsampling)
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # Concatenate P4 and P5
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # Concatenate P5 and P4
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
